{
    "id": 4191100,
    "url": "https://api.case.law/v1/cases/4191100/",
    "name": "SUSAN YURCIC, Plaintiff-Appellant, v. CITY OF GALLUP, GALLUP FLYING SERVICE, and MOLZEN-CORBIN & ASSOCIATES, P.A. Defendants-Appellees, and JOHN DOE CONTRACTOR, Defendant",
    "name_abbreviation": "Yurcic v. City of Gallup",
    "decision_date": "2013-01-24",
    "docket_number": "Docket No. 30,786",
    "first_page": "589",
    "last_page": "601",
    "citations": [{"type": "official", "cite": "2013-NMCA-039"}],
    "volume": {
        "url": "https://api.case.law/v1/volumes/32044132274747/",
        "volume_number": "3",
        "barcode": "32044132274747"
    },
    "reporter": {
        "url": "https://api.case.law/v1/reporters/1028/",
        "full_name": "New Mexico Appellate Reports",
        "id": 1028
    },
    "court": {
        "url": "https://api.case.law/v1/courts/nm-ct-app/",
        "name_abbreviation": "N.M. Ct. App.",
        "slug": "nm-ct-app",
        "id": 9025, "name": "Court of Appeals of New Mexico"
    },
    "jurisdiction": {
        "id": 52,
        "name_long": "New Mexico",
        "url": "https://api.case.law/v1/jurisdictions/nm/",
        "slug": "nm",
        "whitelisted": true,
        "name": "N.M."
    },
    "cites_to": [],
    "frontend_url": "https://cite.case.law/nmca/2013/039/4191100/",
    "frontend_pdf_url": "https://cite.case.law/pdf/4191100/Yurcic%20v.%20City%20of%20Gallup,%202013-NMCA-039%20(2013).pdf",
    "preview": [],
    "analysis": {
        "cardinality": 1400,
        "char_count": 38712,
        "ocr_confidence": 0.823,
        "pagerank": {
            "raw": 5.053260299825214e-08,
            "percentile": 0.31150011234967123
        },
        "sha256": "e8193319763588df4695ff9ff2e58cc87e4c000e19ab39096172d896a16573f8",
        "simhash": "1:1ee2df23aa005a49",
        "word_count": 6248,
        "random_id": 1544629723,
        "random_bucket": 11739
    },
    "last_updated": "2021-08-10T17:15:42.557742+00:00",
    "provenance": {
        "date_added": "2019-08-29",
        "source": "CAP",
        "batch": "2018"
    },
    "casebody": {
        "status": "ok",
        "data": {
            "judges": ["J. MILES HANISEE, Judge", "CYNTHIA A. FRY, Judge", "TIMOTHY L. GARCIA, Judge"],
            "parties": ["SUSAN YURCIC, Plaintiff-Appellant, v. CITY OF GALLUP, GALLUP FLYING SERVICE, and MOLZEN-CORBIN & ASSOCIATES, P.A. Defendants-Appellees, and JOHN DOE CONTRACTOR, Defendant."],
            "opinions": [
                {
                    "text": "OPINION\nHANISEE, Judge.\n{1} Susan Yurcic (Plaintiff) appeals the district court’s grant of summary judgment based
                    upon the statutes of limitations applicable to her lawsuit for damages caused by a flood retention pond located adjacent to her building.
                    Plaintiff argues that disputed material facts exist as to when Plaintiff knew or should have known about the injuries to her property and existence
                    of her claims against Defendants. Alternatively, Plaintiff argues that her property incurred separate injuries, and each new injury had its own
                    discovery date and period of limitation. For reasons explained below, we affirm in part, reverse in part, and remand to the district court.\nI.
                    BACKGROUND\n{2} Plaintiff and Johnna Yurcic (a former plaintiff in this case and Plaintiffs late husband, who died during the pendency of this case)
                    owned property with a building located next to the Gallup airport. In 1998, aretention pond (the pond) was dug directly next to Plaintiffs property to
                    address flooding and drainage concerns on the airport property. The pond has neither an impermeable liner nor an automatic pumping system. Since its
                    construction, the pond has often filled with water and has overflowed following rainstorms. No efforts have everbeen made to pump or drain the pond.
                    Subsequently, water has remained in the pond for long periods of time, seeping into the ground.\n{3} In the years following the pond’s
                    construction, the Yurcics’ building began exhibiting signs of damage to the foundation, walls, roof, and floors. On May 12, 2008, the Yurcics
                    filed a complaint for nuisance, negligence, and damages against the City of Gallup (the owner of the airport), Gallup Flying Service (the airport
                    operator), Molzen- Corbin and Associates, P.A. (the designer of the pond), and a John Doe contractor (the unknown contractor who constructed the pond).
                    In 2010, the City of Gallup (the City), Gallup Flying Service, and Molzen-Corbin (collectively, Defendants) jointly moved for summary judgment premised
                    upon expiration of the applicable statutes of limitations. Defendants argued that, as early as 1998 but no later than 2003, the Yurcics had notice that
                    the pond was damaging their property and that they had a potential claim against Defendants. Defendants respectively contended that because a two-year
                    statute of limitations applies to claims against the City and a four-year statute of limitations applies to claims against the other defendants, the
                    Yurcics’ 2008 lawsuit was barred in its entirety because the lawsuit was not brought within either requisite period of prescription.\n{4} In
                    response, Plaintiff asserted that evidence established the existence of disputed material facts as to whether she had notice of the damage and the
                    potential claim against Defendants before the statutes of limitations ran. Plaintiff also argued that summary judgment was inappropriate because her
                    property suffered successive injuries from the pond’s seepage, for which new statutes of limitations accrued under Valdez v. Mountain Bell
                    Telephone Co., 107 N.M. 236, 239, 755 P.2d 80, 83 (Ct. App. 1988) (holding that the plaintiff could sue for successive seepage injuries caused by a
                    utility pole, even though the statute of limitations expired on his initial claim, if the pole could be removed or the nuisance could be abated at a
                    reasonable cost, or if the extent of the damages were not necessarily ascertainable when the plaintiff purchased the property). Following briefing by
                    the parties and a hearing on Defendant’s motion, the district court granted the motion. Plaintiff now appeals.\nII. STANDARD OF REVIEW\n{5}
                    “An appeal from the grant of a motion for summary judgment presents a question of law and is reviewed de novo.” Montgomery v. Lomos Altos,
                    Inc., 2007-NMSC-002, ¶ 16, 141 N.M. 21, 150 P.3d 971. “Summary judgment is appropriate where there are no genuine issues of material fact and
                    the movant is entitled to judgment as a matter of law.” Self v. United Parcel Serv., Inc., 1998-NMSC-046, ¶ 6, 126 N.M. 396, 970 P.2d 582.
                    “On appeal from the grant of summary judgment, we ordinarily review the whole record in the light most favorable to the party opposing summary
                    judgment to determine if there is any evidence that places a genuine issue of material fact in dispute.” City of Albuquerque v. BPLW Architects &
                    Eng’rs, Inc., 2009-NMCA-081, ¶ 7, 146 N.M. 717, 213 P.3d 1146. “However, if no material issues of fact are in dispute and an appeal
                    presents only a question of law, we apply de novo review and are not required to view the appeal in the light most favorable to the party opposing
                     summary judgment.” Id. “We are mindful that summary judgment is a drastic remedial tool which demands the exercise of caution in its
                      application, and we review the record in the light most favorable to support a trial on the merits.” Woodhull v. Meinel, 2009-NMCA-015, ¶ 7,
                      145 N.M. 533, 202 P.3d 126 (internal quotation marks and citation omitted).\nIII. DISCUSSION\nA. Disputed Material Facts Exist as to Whether Plaintiff
                      Filed Her Complaint Within the Four-Year Statute of Limitations\n{6} Plaintiff contends that disputed material facts exist as to whether the statute of limitations expired prior to her filing the complaint against Defendants. We first address the applicable statutes of limitations and then review Plaintiff’s arguments regarding the existence of disputed facts.\n{7} Pursuant to NMSA 1978, Section 37-1-4 (1880), a four-year statute of limitations generally applies to claims “brought for injuries to property.” Plaintiff concedes and we agree that a four-year statute of limitations generally applies to this suit under this statute. But Defendants argued below and continue to argue on appeal that a two-year statute of limitations applies to the City under NMSA 1978, Section 41-4-15 (1977) of the Tort Claims Act. In its order granting summary judgment, the district court did not specifically address whether it applied a two- or four-year statute of limitations to Plaintiff’s claims against the City. Nonetheless, we conclude that, as a matter of law, the two-year statute of limitations applies to claims brought against the City.\n{8} Section 41-4-15(A) states that “[ajctions against a governmental entity' [must be] commenced within two years after the date of occurrence resulting in loss, injury or death[.]” In Cole v. City of Las Cruces, 99 N.M. 302, 305, 657 P.2d 629, 632 (1983), our Supreme Court expressly stated that a city is a governmental entity “because of its legal status as a local public body and as a political [subdivision] of the state.” (alteration in original) (internal quotation marks and citations omitted). Pursuant to Cole, the City of Gallup likewise is both a public body and political subdivision of the state. Thus, it is clearly a governmental entity, and the two-year statute of limitations applies to Plaintiff’s claim against it.\n{9} Knowing the applicable periods of limitation, we move on to discuss the key issue in this case: does evidence conflict as to when the existence of notice to Plaintiff commenced the periods of limitation? “[I]n actions for injuries to . . . property, the cause of action shall not be deemed to have accrued until the . . . injury . . . complained of, shall have been discovered by the party aggrieved.” NMSA 1978, Section 37-1-7 (1880). “[U]nder the discovery rule, the statute of limitations begins when the plaintiff acquires knowledge of facts, conditions, or circumstances which would cause a reasonable person to make an inquiry leading to the discovery of the concealed cause of action.” Gerke v. Romero, 2010-NMCA-060, ¶ 10, 148 N.M. 367, 237 P.3d 111 (internal quotation marks and citation omitted); see Wilde v. Westland Dev. Co., Inc., 2010-NMCA-085, ¶ 18, 148 N.M. 627, 241 P.3d 628 (“For purposes of determining when the cause of action accrues, discovery is defined as the discovery of such facts as would, on reasonable diligent investigation, lead to knowledge of [the] fraud or other injury.” (alteration in original) (internal quotation marks and citation omitted)). This means that “the statute of limitations is not tolled because a claimant does not have knowledge of the full extent of injury, but that the time period begins to run when the claimant has knowledge of sufficient facts to constitute a cause of action.” Gerke, 2010-NMCA-060, ¶ 10 (citation omitted). We subsequently refer to the standard set forth in the discovery rule, which requires knowledge of facts, conditions, or circumstances which would cause a reasonable person to make an inquiry leading to the discovery of the cause of action, as “inquiry notice.” See TRW Inc. v. Andrews, 534 U.S. 19, 30 (2001) (stating that certain events would place the plaintiff on “inquiry notice, and the discovery rule would trigger the limitations period at that point, only if a reasonable person in [the plaintiffs] position would have learned of the injury in the exercise of due diligence.” (internal quotation marks omitted)); Rhinehart v. Nowlin, 111 N.M. 319, 328, 805 P.2d 88, 97 (Ct. App. 1990) (“Whatever puts a party upon inquiry is sufficient ‘notice’ and the party has a duty to inquire or he will be chargeable with all the facts.”).\n{10} “Historically, the courts of this state have characterized the application of the discovery rule as a jury question, particularly when conflicting inferences may be drawn.” Williams v. Stewart, 2005-NMCA-061, ¶ 16, 137 N.M. 420, 112 P.3d 281. “As a general rule, issues as to whether a claim has been timely filed or whether good cause exists for delay in filing an action are questions of fact, and such issues only become issues of law when the facts are undisputed.” Durham v. Sw. Developers Joint Venture, 2000-NMCA-010, ¶ 44, 128 N.M. 648, 996 P.2d 911. “Where there are disputed questions of material fact as to whether a plaintiff is barred by the statute of limitations, these questions are to be decided by a jury.” Medina v. Fuller, 1999-NMCA-011, ¶ 22, 126 N.M. 460, 971 P.2d 851 (alteration, internal quotation marks, and citation omitted).\n{11} In granting summary judgment, the district court determined that Plaintiff had sufficient notice of facts constituting a cause of action against Defendants at the time of at least one of three instances of notice argued by Defendants. In their motion to dismiss, Defendants asserted that Plaintiff acquired inquiry notice of the cause of action first in 1998, when the pond was constructed, second in 2001, and third in 2002 or 2003. Each instance of notice asserted by Defendants occurred in excess of four years from filing the complaint. We analyze the evidence presented by the parties below to determine whether there are any disputed material facts as to whether Plaintiff was or should have been on notice of a claim against Defendants at the time of each asserted instance.\n{12} Defendants first argued that sometime in 1998, Plaintiff noticed that “the northeast corner of the Yurcic Building had some structural-type cracks in the masonry, the slab had some cracks in it, and the corner of the building was sinking.” Defendants supported their argument with testimony from Pat Mataya, a contractor who remodeled the building in 1998. In a deposition, Mataya testified that Johnna Yurcic knew of and was concerned about the above described structural-type cracks in the masonry and foundation of the building. He added that Johnna Yurcic expressed concerns that the pond was causing some of the problems with the building. To rebut this evidence, Plaintiff presented testimony of Bob Witte, a former tenant of Plaintiffs building. Prior to his initial occupation of the building in March 1998, Witte examined the premises and found no noticeable problems with the exterior or interior structure of the building at that time. Witte also testified that he first noticed problems with the building’s exterior in 2001. We conclude that this conflicting testimony regarding the presence or absence of visible signs of building damage presents a question of fact as to whether there was any visible structural damage to the building in 1998 that would have then placed Plaintiff on inquiry notice of a cause of action against Defendants. Moreover, reasonable jurors listening to this conflicting testimony could disagree about the veracity of Mataya’s testimony or the timing of Mataya’s conversation with Johnna Yurcic about the pond. It would therefore be improper for the district court to have granted summary judgment on the basis of the 1998 alleged acquisition of notice.\n{13} Next, Defendants argued that Plaintiff had inquiry notice of a claim against Defendants when Witte reported a crack in the floor tiles ofthe building in 2001. Defendants stated and Plaintiff does not contest that in 2001, “Witte noticed [and reported to Johnna Yurcic] that the tiles laid during the 1998 [r]emodel were separating and that there was a quarter-inch crack in the floor that ran the entire length ofthe Yurcic building.” Plaintiff argues that this fact alone is legally insufficient to cause a reasonable person to make an inquiry leading to the discovery of the cause of action against Defendants.\n{14} In district court, Defendants did not offer any proof that this crack would lead a reasonable person to inquire as to the pond’s deteriorative effect on the building’s foundation. Due to the absence of evidence within the record linking the appearance ofthe crack with the nearby pond, we are unable to eliminate contrary explanations for this crack as a matter of law. In fact, Mataya’s testimony attributed the crack to a cause other than the pond. In response to Defendants’ question regarding the crack, Mataya explained that the crack “might have just been a control joint. . . . [W]hen they pour the [concrete] slab, sometimes they’ll have a control joint to separate the slabs, or the[y are] saw cut.” Because the crack in the tile floor might have been caused by an extrinsic source, such as a control joint, and there was then no evidence specifically linking the crack to the pond, we conclude that mere knowledge of the existence of the crack in 2001 was legally insufficient to place Plaintiff on inquiry notice of a claim against Defendants.\n{15} Lastly, relying on testimony from Witte, Defendants argue that in 2002 or 2003, Johnna Yurcic knew of the combination of structural damage and saturated ground sufficient to have acquired inquiry notice of the claim against Defendants. Witte initially testified that in 2002 or 2003, he noticed and then informed Johnna Yurcic about a crack in the foundation of the northeast corner of the building, where the ground was “mushy.” Witte described the damage as a “stair step crack” that extended ten feet on either side of the northeast corner of the building. Witte testified that he notified Johnna Yurcic of the crack and told him that he believed the pond was the cause of the building’s damage. Based on that conversation, Johnna Yurcic sent a person to inspect the crack shortly thereafter.\n{16} In response, Plaintiff countered that this conversation did not occur until 2004, and therefore a genuine issue of material fact exists as to whether Plaintiff had notice of the damage prior to May 12,2004 (more than four years before filing this case). Plaintiff cited Witte’s own subsequent testimony during the same deposition, where Witte clarified that he noticed the crack in the northeast corner of the building sometime after appearing at a city council meeting to express his concerns about mosquitos breeding in the pond. Witte stated that he noticed the foundational crack “[ajnywhere from six months to a year” after the city council meeting. When pressed for a greater level of specificity as to the timing of the notifying conversations, Witte responded that his “time-frame on this” was unclear as to the precise date. Plaintiff argued below and continues to assert on appeal that the city council meeting took place in June 2003. Yet neither Defendants nor Plaintiff provided evidence as to when the city council meeting in question took place.\n{17} Because ofthe express uncertainty of Witte’s recollection, combined with the parties’ inability to ascertain with greater precision the date on which the city council meeting took place, we conclude that Witte’s testimony is inconclusive as to precisely when, within the window of time between 2002 and 2004, he noticed and reported to Johnna Yurcic the damage to the northeast corner of the building. Because this last of the asserted grounds for summary judgment was also premised upon what are actually disputed material facts, it too fails to factually establish that Plaintiff had inquiry notice in excess of four years from when the Yurcic complaint was filed.\n{18} Because material disputed facts exist about when Plaintiff acquired a sufficient level of inquiry notice as to the existence of any claim assertable against Defendants, summary judgment as to Gallup Flying Service and Molzen-Corbin was improper. We therefore reverse the district court’s order as to those Defendants.\nB. Plaintiff Had Notice of the Claims Against the City More Than Two Years Before Filing\n{19} Also based upon the foregoing discussion of evidence, it appears that Plaintiff acquired inquiry notice of the claim against the City more than two years before the Yurcic lawsuit was filed. Defendants’ evidence establishes that sometime in 2004 or earlier, Johnna Yurcic received notice that the foundation on the northeast side of the building was substantially cracking, that the ground around it was saturated with water, and that his tenant, Witte, by then believed the pond to be the cause of the damage. The only arguments Plaintiff makes to rebut Defendants’ contentions about notice of the moistened ground and the crack in the building’s northeast corner is (1) that the notice occurred sometime within a year after June 2003, the date on which Plaintiff alleges the city council meeting took place; and (2) that she personally — distinct from her husband Johnna Yurcic — never had notice of damage to the building until 2006.\n{20} First, the facts of which Witte notified Johnna Yurcic by June 2004 placed Plaintiff on inquiry notice more than three years before the suit was brought. Unlike the earlier, more questionable evidence of the crack in the floor tiles, this latter evidence provided ample indicia of a causal nexus between the pond’s saturation of the ground and the building’s worsening structural damage. Evidence of the foundation’s twenty-foot-long stair step crack, surrounded by soggy ground, and the tenant’s communication with Johnna Yurcic that he believed the pond to be causing the foundational damage was sufficient to notify Plaintiff of both (1) serious structural damage requiring further investigation, and (2) a causal link between the pond and the injury to Plaintiffs property. See generally Palumbo v. Roberti, 839 F. Supp. 80, 85 (D. Mass. 1993) (holding that inquiry notice was satisfied where the plaintiff had knowledge both of oil stored in the nearby neighboring building and of damage to goods in her building caused by oil seepage); Redland v. Tharp, 498 P.2d 1240, 1242 (Wyo. 1972) (concluding that the plaintiffs were on notice of their claim regarding seepage “when the area of [the] plaintiffs’ land became so boggy that farm machinery, vehicles, and equipment became stuck”).\n{21} Second, to the extent Plaintiff argues that she did not individually gain inquiry notice of the damage until 2006, we conclude that the requirement of diligence as a co-owner of the visibly damaged property warrants enforcement of the statute of limitations against her. Under the discovery rule, “the statute of limitations begins to run when the plaintiff knows or, with reasonable diligence should know, of his injury and its cause.” Gerke, 2010-NMCA-060, ¶ 12; see McNeill v. Burlington Res. Oil & Gas Co., 2008-NMSC-022, ¶ 37, 143 N.M. 740, 182 P.3d 121 (“In New Mexico, a cause of action arises when the plaintiff discovers or with reasonable diligence should have discovered that a claim exists.” (internal quotation marks and citation omitted)); Williams v. Stewart, 2005-NMCA-061, ¶ 12, 137 N.M. 420, 112 P.3d 281 (stating that “[t]he discovery rule provides that the cause of action accrues when the plaintiff discovers or with reasonable diligence should have discovered that a claim exists” (internal quotation marks and citation omitted)); Milwaukee Area Vocational Technical & Adult Educ. Dist. v. U.S. Steel Corp., 847 F.2d 435, 440 (7th Cir. 1988) (stating that “the discovery rule is an objective standard that does not protect those plaintiffs who sleep on their rights”); H. F. Wilcox Oil & Gas Co. v. Diffie, 186 F.2d 683, 697 (10th Cir. 1951) (concluding that an action brought by the plaintiff, the part-owner of a mine, against his co-owner for conversion was barred by the statute of limitations where the plaintiff failed to exercise diligence by examining his co-owner’s records, or asking the co-owner for a report regarding the subject mine); Martin v. Esponge, 388 So. 2d 128, 129 (La. Ct. App. 1 Cir. 1980) (stating that in the context of a leasing agreement, “a co-owner acts not only for himself but also as the agent of his other co-owners” (internal quotation marks and citation omitted)). Here, it is clear that Johnna Yurcic, Plaintiffs husband and co-owner of the property, discovered the damage no later than when it was reported to him by his tenant, Witte. If Plaintiff had been reasonably diligent as a co-owner, she would have, at a minimum, communicated with her co-owner or tenant regarding the status of her property. The assertion that Plaintiff did not engage in communications regarding the seepage and damage, and the absence of her actual knowledge of it, does not absolve Plaintiff of her duty to be reasonably diligent in discovering the injury and cause.\n{22} Thus, the claims against the City are time barred unless Plaintiff can succeed under her theory that each successive injury gave rise to a new cause of action with its own discovery date and period of limitation. We note that this theory bears the potential to also affect Plaintiff’s claim with regard to the other Defendants.\nC. Summary Judgment Was Improper Under Valdez\n{23} Plaintiff also contends that summary judgment was improper because successive injuries occurred to the property due to the pattern of ongoing seepage and, as a result, under Valdez, separate causes of action accrued with each new injury to the property. Plaintiff therefore asserts that, under Valdez, her claims for successive injuries arising within the statute of limitations are notbarred. We must determine whether under Valdez, Plaintiff’s injuries constitute separate causes of action with their own statutes of limitation. We note that if Plaintiff can only succeed in bringing her suit under the successive injury theory established by Valdez, her recovery is limited to those injuries incurred within the respective two- and four-year statutes of limitations. McNeill v. Rice Eng’g & Operating, Inc., 2006-NMCA-015, ¶ 29, 139 N.M. 48, 128 P.3d 476 (stating that, “[ajlthough . . . some jurisdictions set the cause of action accrual date for a claim for damages for all injuries from the continuing trespass to be the date of the last injury}, under Valdez, t]he accrual date is the date of each particular injury which, for an intermittent injury, is the date of that discrete injury, or for a continuous injury, each new day”).\n{24} In Valdez, a property owner sued a public service company for improperly maintaining a telephone pole near a drainage ditch on the south side of the plaintiffs property, which caused water to back up onto and seep into the owner’s land. 107 N.M. at 237-38, 755 P.2d at 81-82. Within two or three years of purchasing his home, the plaintiff observed that “the land on the south side of his home was constantly damp.” Id. at 238, 755 P.2d at 82. Almost a decade after purchase, the plaintiff noticed that walls inside his home were cracking and was notified by his insurance company that the cracks were caused by seepage. Id. Several years after the initial wall cracking, the foundation on the south side of his house began sinking, cracking, and falling apart. Id. Under the facts of Valdez, it appeared that the plaintiff knew, well beyond the applicable statute of limitations on his initial claim, that his property had suffered damage as a result of water seepage. Id. On appeal we considered, as a matter of first impression, whether a cause of action can accrue with every new injury to the plaintiffs property or whether the plaintiffs complaint was time-barred because the statute of limitations had already run on the first injury caused by the recurring seepage. Id.\n{25} After examining case law from other states dealing with this issue, we held that, when the “nuisance is of permanent character, and its construction and continuance are necessarily an injury, the damage is original, and . . . the statute of limitations begins to run upon the construction of the nuisance.” Id. at 240, 755 P.2d at 84 (internal quotation marks and citation omitted). On the other hand, we concluded that the plaintiff in Valdez could recover for successive injuries from a temporary structure, which we defined as either “a permanent structure which is not per se injurious” but which becomes injurious under certain, temporary conditions, or a structure that “could possibly be easily removed at a reasonable expense.” Id. In other words, if the nuisance is permanent and therefore necessarily injurious, Plaintiff would not be able to recover if the statute of limitations has run on her initial claim because subsequent causes of action are not created by subsequent injuries. But, if the nuisance is temporary, Plaintiff could sue for later injuries caused by the same seepage, as the statute of limitations would run anew with subsequent injuries. We defined “[a] permanent structure or nuisance [a]s one that may not be readily remedied, removed or abated at a reasonable expense, or one of a durable character evidently intended to last indefinitely, costing as much to alter as to build.” Id. at 239, 755 P.2d at 83. In sum, the nuisance is temporary if either the structure can be removed at a reasonable cost or the nuisance can be remedied or abated at a reasonable cost.\n{26} This Court in Valdez explained that, “[the pjlaintiff alleges that the utility pole . . . is a permanent structure which is not per se injurious, but becomes so with excessive rain or snow. As such, the nuisance is temporary.” Id. at 240, 755 P.2d at 84. We also came to the conclusion that “the utility pole . . . could probably be easily removed at a reasonable expense, and is, therefore, a temporary structure.” Id. We held that, “[i]n either case, successive actions may be brought because each new injury allows a new cause of action to accrue.” Id. Additionally, we went on to hold that “successive recoveries should he allowed following each injury, where the improvement is negligently constructed and the damage to plaintiffs property could not be reasonably calculated at the time of the completion of the construction thereof.” Id. With these principles in mind, we concluded that the Valdez plaintiff could sue for successive injuries caused by the utility pole, even though the statute of limitations expired on his initial claim, because “the nuisance . . . is abatable},] the injuries are recurring},] the extent of the damages were not necessarily ascertainable when plaintiff purchased the property},] and the nuisance is not necessarily injurious.” Id.\n{27} In applying Valdez to the case at bar to determine whether Plaintiff can sue for successive injuries, we identify the pertinent factual inquiries to be: (1) whether the pond can be removed at a reasonable cost, (2) whether the seepage can be remedied or abated at a reasonable expense, and (3) whether the damages caused by the seepage on Plaintiff’s property could have been ascertainable when the pond was built. Neither party below produced evidence to address these issues.\n{28} On appeal, Defendants nonetheless contend that summary judgment was proper because “Plaintiff presented no evidence below to demonstrate that the retention pond was a temporary structure such that the rule in Valdez applied.” Defendants support this assertion with a citation and parenthetical indicating that when Defendants have met their burden of demonstrating a prima facie case in support of summary judgment, Plaintiff “bears the burden of demonstrating the existence of specific facts to support a trial on the merits.” Implicit in this assertion is that Defendants have successfully made a prima facie case for summary judgment. Although Defendants correctly state the standard for shifting burdens of proof, we conclude that they failed to make a prima facie showing below.\n{29} “In the civil litigation context, the statute of limitations defense is generally an affirmative defense}.]” State v. Kerby, 2007-NMSC-014, ¶ 13, 141 N.M. 413, 156 P.3d 704. When asserting an affirmative defense as grounds for summary judgment, the “[djefendant carrie[s] the burden of making a prima facie showing as to each element of the definition [of the defense].” Solorzano v. Bristow, 2004-NMCA-136, ¶ 15, 136 N.M. 658, 103 P.3d 582 (discussing the moving party’s burden in seeking summary judgment against the plaintiff on the affirmative defense of suicide); see Romero v. Philip Morris Inc., 2010-NMSC-035, ¶ 10, 148 N.M. 713, 242 P.3d 280 (stating that the moving party has the initial burden of establishing a prima facie case for summary judgment). Prima facie case is defined as “[a] party’s production of enough evidence to allow the fact-trier to infer the fact at issue and rule in the party’s favor.” Black’s Law Dictionary 1310 (9th ed. 2009); see Hyden v. Law Firm of McCormick, Forbes, Caraway & Tabor, 115 N.M. 159, 163, 848 P.2d 1086, 1090 (Ct. App. 1993) (stating that a prima facie showing is defined as “such evidence as is sufficient in law to raise a presumption of fact or establish the fact in question unless rebutted” (internal quotation marks and citation omitted)).\n{30} Since the statute of limitations is Defendants’ affirmative defense and since Defendants are the moving parties, they have the burden of producing evidence regarding every element of that defense. Here, the trier of fact cannot infer the necessary facts to conclude that the suit is time barred without Defendants producing sufficient evidence to address the issues pertinent to a Valdez determination. Thus, in order to obtain summary judgment on the statute of limitations affirmative defense, Defendants have the duty to produce sufficient evidence showing that the pond and seepage are permanent and that the damages were ascertainable at the time the pond was constructed. Valdez, 107 N.M. at 240, 755 P.2d at 84. Because Defendants failed to make the requisite prima facie case, Plaintiff bore no obligation to produce evidence to the contrary.\n{31} Defendants argue that Valdez does not apply to this case, in part because the injuries were not successive. We conclude there is abundant evidence to the contrary sufficient to create a disputed issue of material fact. In arguing otherwise, Defendants rely solely on testimony from Witte that the ground was “constantly wet.” First, this appears to misconstrue Witte’s testimony, in which he then discussed the character of the ground during monsoon season. Second, Plaintiff argued from the inception of this case that “[w]hen the pond is full due to precipitation},] the water is not contained inside the Airport’s property . . . but instead the water migrates beneath the surface into the Yurcics’ property.” The record appears to provide support to this theory that the pond was only a nuisance when full, particularly during monsoon season. Moreover, the record shows that there was a series of different injuries to the building: different cracks and damage developed in the foundation, walls, and ceiling over time. Lastly, it appears that Defendants misconstrue our case law regarding the characteristics of successive injuries. In Valdez, the seepage caused the ground to be constantly damp, and such seepage resulted in a series of injuries, similar to those which manifested in the case at bar. See Valdez, 107 N.M. at 238, 755 P.2d at 82. Based on the standard exemplified in Valdez, Plaintiff appears to have incurred successive injuries. For these reasons, we conclude that at the very least, disputed material facts exist regarding whether the injuries were successive.\n{32} Defendants argue that because “Johnna Yurcic was aware of specific damages to his property [between 1998 and 2003] and believed that the pond was to blame[,]” he cannot recover under the continuing wrong doctrine stated in Valdez. For support, Defendants cite out-of-state case law for the proposition that “the doctrine cannot be employed where the plaintiffs injury is definite and discoverable, and nothing prevented the plaintiff from coming forward to seek redress.” See Tiberi v. Cigna Corp., 89 F.3d 1423, 1431 (10th Cir. 1996) (internal quotation marks and citation omitted). We disagree because first, as determined above, Defendants have yet to prove that prior to June 2004, Johnna Yurcic was or should have been aware of a definite injury caused by Defendants sufficient to constitute inquiry notice. Second, Defendants appear to misconstrue the principle regarding definite and discoverable injuries, which was originally derived from Wilson v. Giesen, 956 F.2d 738, 743 (7th Cir. 1992). The court in Wilson explained that a definite and discoverable injury was one resulting from a tortious act which “caused direct damages that occurred at a certain point in time — resulting in immediate and direct injury . . . with consequential effects.” Id. (alteration in the original) (internal quotation marks and citation omitted). In the case at bar, the damages occurred gradually over a long period of time, in relation to the rise and fall of the pond water levels. There was no one specific point in time at which the building suddenly sunk into the soggy ground, breaking the foundation and cracking the building’s walls, floors, and ceiling. The injury was gradual and incremental, not immediate. Thus, the continuing wrong theory appears to be applicable to this case.\n{33} Arguing again that Valdez is inapplicable, Defendants cite Colorado case law for the proposition that claims involving seepage arise when the property is first visibly affected by the seepage. See Greene v. Green Acres Constr. Co., 543 P.2d 108 (Colo. App. 1975). We note that Greene is legally distinct from the present inquiry regarding successive injuries. Rather, it deals with the initial discovery of the injury, which is a topic we have already dealt with above when analyzing the issue of when Plaintiff acquired notice of the Yurcic cause of action. Thus, we are unp ersuaded by D efendants ’ assertion that this case is more similar to Greene than Valdez.\n{34} Since Defendants failed to present sufficient evidence establishing that separate causes of action did not accrue with each ensuing injury to the property and therefore failed to demonstrate that Valdez is inapplicable here, summary judgment was improper. We thus reverse the district court on this ground as well.\nC. Plaintiff Failed to Preserve Her Estoppel Argument\n{35} Finally, Plaintiff argues the doctrine of equitable estoppel tolled the statute of limitations in this case. Yet Plaintiff never argued estoppel below. “To preserve an issue for review on appeal, it must appear that appellant fairly invoked a ruling of the trial court on the same grounds argued in the appellate court.” Woolwine v. Furr’s, Inc., 106 N.M. 492, 496, 745 P.2d 727, 721 (Ct. App. 1987). The preservation rule “provides the lower court an opportunity to correct any mistake,... provides the opposing party a fair opportunity to show why the court should rule in its favor, and . . . creates a record from which this Court may make informed decisions.” State v. Lopez, 1008-NMCA-001, ¶ 8, 143 N.M. 274, 175 P.3d 942 (alterations in the original) (internal quotation marks and citation omitted).\n{36} Here, Plaintiff argues that she raised the issue below in her answer brief responding to the motion to dismiss. Yet the answer brief merely stated in a footnote that “Plaintiff also notes that she and Johnna Yurcic held off on filing their complaint while waiting for a response to the tort claims notice that they had filed in June 2007. A response was not received on behalf of the City of Gallup until September 2007.” We conclude that this footnote was insufficient to preserve the issue of estoppel for appellate review, as it never invoked a ruling on the issue from the district court, and it failed to alert Defendants to an opportunity to argue against estoppel below. As a result, we have no record from which to render an informed ruling on the issue. We therefore decline to address Plaintiffs estoppel argument on appeal. See Andalucia Dev. Corp. v. City of Albuquerque, 2010-NMCA-052, ¶ 25, 148 N.M. 277, 234 P.3d 929 (“Appellate courts will not consider issues that went unpreserved at the district court level.”).\nIV. CONCLUSION\n{37} We reverse the district court’s order of summary judgment because (1) disputed material facts exist as to whether the statute of limitations barred Plaintiffs initial claims against Gallup Flying Service and Molzen-Corbin, and (2) disputed material facts exist regarding whether separate causes of action accrued with each new injury to the property under Valdez. We remand to the district court for proceedings consistent with this Opinion.\n{38} IT IS SO ORDERED.\nJ. MILES HANISEE, Judge\nWE CONCUR:\nCYNTHIA A. FRY, Judge\nTIMOTHY L. GARCIA, Judge",
                      "type": "majority",
                      "author": "HANISEE, Judge."
                    }
            ],
            "attorneys": ["Kelley Law Offices Cody K. Kelley Charlotte L. Itoh Albuquerque, NM for Appellant", "Mason & Isaacson, P.A. Lynn Isaacson Gallup, NM for
                            Appellee City of Gallup", "Keleher & McLeod, P.A. Charles A. Pharris Cassandra R. Malone Albuquerque, NM for Appellee Gallup Flying Service", "Montgomery & Andrews, P.A. Kevin M. Sexton Jaime R. Kennedy Albuquerque, NM for Appellee Molzen-Corbin & Associates, P.A."],
            "corrections": "",
            "head_matter": "IN THE COURT OF APPEALS OF THE STATE OF NEW MEXICO\nOpinion Number: 2013-NMCA-039\nFiling Date: January 24, 2013\nDocket No. 30,786\nSUSAN
                            YURCIC, Plaintiff-Appellant, v. CITY OF GALLUP, GALLUP FLYING SERVICE, and MOLZEN-CORBIN & ASSOCIATES, P.A. Defendants-Appellees, and JOHN DOE CONTRACTOR, Defendant.\nKelley Law Offices Cody K. Kelley Charlotte L. Itoh Albuquerque, NM for Appellant\nMason & Isaacson, P.A. Lynn Isaacson Gallup, NM for Appellee City of Gallup\nKeleher & McLeod, P.A. Charles A. Pharris Cassandra R. Malone Albuquerque, NM for Appellee Gallup Flying Service\nMontgomery & Andrews, P.A. Kevin M. Sexton Jaime R. Kennedy Albuquerque, NM for Appellee Molzen-Corbin & Associates, P.A."
        }
    }
}
{"id": 4190470, "url": "https://api.case.law/v1/cases/4190470/", "name": "LA VIDA LLENA, Protestant-Appellee, v. KAREN L. MONTOYA, BERNALILLO COUNTY ASSESSOR, BERNALILLO COUNTY VALUATION PROTEST BOARD, Respondent-Appellant", "name_abbreviation": "La Vida Llena v. Montoya", "decision_date": "2013-02-19", "docket_number": "Docket No. 31,711", "first_page": "692", "last_page": "700", "citations": [{"type": "official", "cite": "2013-NMCA-048"}], "volume": {"url": "https://api.case.law/v1/volumes/32044132274747/", "volume_number": "3", "barcode": "32044132274747"}, "reporter": {"url": "https://api.case.law/v1/reporters/1028/", "full_name": "New Mexico Appellate Reports", "id": 1028}, "court": {"url": "https://api.case.law/v1/courts/nm-ct-app/", "name_abbreviation": "N.M. Ct. App.", "slug": "nm-ct-app", "id": 9025, "name": "Court of Appeals of New Mexico"}, "jurisdiction": {"id": 52, "name_long": "New Mexico", "url": "https://api.case.law/v1/jurisdictions/nm/", "slug": "nm", "whitelisted": true, "name": "N.M."}, "cites_to": [], "frontend_url": "https://cite.case.law/nmca/2013/048/4190470/", "frontend_pdf_url": "https://cite.case.law/pdf/4190470/La%20Vida%20Llena%20v.%20Montoya,%202013-NMCA-048%20(2013).pdf", "preview": [], "analysis": {"cardinality": 898, "char_count": 22322, "ocr_confidence": 0.835, "pagerank": {"raw": 1.0304479816859e-07, "percentile": 0.5426391426254653}, "sha256": "d55d1115ff323e144e6281819175ffae4fa409213eea49e209e0c44377c6c355", "simhash": "1:cdfde5ba4be41282", "word_count": 3579, "random_id": 243775512, "random_bucket": 47128}, "last_updated": "2021-08-10T17:15:42.557742+00:00", "provenance": {"date_added": "2019-08-29", "source": "CAP", "batch": "2018"}, "casebody": {"status": "ok", "data": {"judges": ["JAMES J. WECHSLER, Judge", "MICHAEL E. VIGIL, Judge", "TIMOTHY L. GARCIA, Judge"], "parties": ["LA VIDA LLENA, Protestant-Appellee, v. KAREN L. MONTOYA, BERNALILLO COUNTY ASSESSOR, BERNALILLO COUNTY VALUATION PROTEST BOARD, Respondent-Appellant."], "opinions": [{"text": "OPINION\nWECHSLER, Judge.\n{1} Appellant Karen Montoya, Bernalillo County Assessor (the Assessor), appeals from the district court’s order reversing the Bernalillo County Valuation Protest Board’s (the Board) determination that Appellee La Vida Llena is not entitled to a charitable exemption from property tax. On appeal, we consider whether the property tax exemption for a continuing care facility that donates or renders gratuitously a portion of its facilities or services for charitable purposes found in NMSA 1978, Section 7-36-7(B)(l)(d) (2008) requires the continuing care facility to donate or to render gratuitously a minimum threshold amount in order to qualify for the exemption. We hold that (1) Section 7-36-7(B)(l)(d) does not require a minimum threshold amount of donated or gratuitously rendered services or facilities for charitable purposes in order for the continuing care facility to receive the property tax exemption, and (2) the district court did not err by failing to give deference to certain findings of the Board. Accordingly, we affirm.\nBACKGROUND\n{2} La Vida Llena operates as a continuing care facility pursuant to the New Mexico Continuing Care Act, NMSA 1978, §§ 24-17-1 to -18 (1985, as amended through 2010). As governed by the Continuing Care Act, a continuing care facility is a live-in community that provides for “the residential, social and health maintenance needs for the elderly.” Section 24-17-2(A). La Vida Llena requires that new residents of its facility be at least sixty-two years old and capable of living independently. {3} In order to qualify for residency at La Vida Llena’s facility, potential residents are required to possess assets equal to double their entrance fee and have a monthly income of one and one-half times their monthly fee. Residents pay an entrance fee of between $91,000 to $342,000 based on the size of the unit to be occupied. Residents pay a monthly fee ranging from $1697 to $3870 for the remainder of their stay. Once residents move into La Vida Llena’s facility, their monthly payments remain the same regardless of whether the intensity of care increases. The entrance fee covers the expected cost for additional needs of the residents as they age.\n{4} On April 20, 2010, the Assessor sent a notice of valuation for property taxes for La Vida Llena’s facility. On May 18, 2010, La Vida Llena filed an application for exemption of property tax, which the Assessor denied. La Vida Llena filed an appeal to the Board. It based its claim for exemption upon its status as a facility operating under the Continuing Care Act and Section 7-36-7(B)(l)(d). Section 7-36-7(B)(l)(d) provides for a property tax exemption for continuing care facilities if the facility meets three criteria: the facility (1) has been granted an exemption from federal income taxes pursuant to 26 U.S.C. § 501(c)(3) (2010); (2) “donates or renders gratuitously a portion of its services or facilities;” and (3) “uses all funds remaining after payment of its usual and necessary expenses of operation, including the payment of liens and encumbrances upon its property, to further its charitable purpose, including the maintenance, improvement or expansion of its facilities.”\n{5} After an evidentiary hearing, the Board upheld the Assessor’s denial of La Vida Llena’s claimed exemption. The Board concluded that La Vida Llena failed to demonstrate that it “donates or renders gratuitously a portion of its services or facilities” for charitable purposes as contemplated by Section 7-36-7(B)(l)(d). The Board made several factual findings regarding evidence that La Vida Llena presented to support its position that it did “donate[] or render[] gratuitously a portion of its services or facilities[.]” Section 7-36-7(B)(1)(d). The Board found that:\n19. [La Vida Llena] controls what is in essence a captive foundation solely for the benefit of residents unable to meet their obligations. The foundation, funded by resident contributions, helps residents with bills, such as pharmacy, dentist and other medical bills and in some instances credit card bills and pays out $65,000-$100,000 per year.\n20. Residents receive help from the foundation for different periods oftime and in different amounts, but are given care for life regardless of ability to pay; residents are not asked to leave if they run out of funds after being accepted for entry.\n21. As a separate track, when space is available [La Vida Llena] serves Medicaid residents who are not members of the community as described above. There is a “differential” between cost and Medicaid reimbursement.\n22. [La Vida Llena] makes its facilities available for meetings by numerous groups. These tend to be groups with which residents or employees have an association or interest.\n23. Employees are permitted time to serve other charitable organizations.\nHowever, the Board determined that it “cannot find that any material portion of [La Vida Llenaj’s services and facilities are ‘donated’ or ‘rendered gratuitously’ as those terms are commonly used. Rather, the use of [La Vida Llena] ’s services and facilities is incidental to its business operations.” (Emphasis added.)\n{6} La Vida Llena appealed the Board’s decision to the district court. The district court reversed the Board’s decision, holding that the Board’s factual findings supported a determination that La Vida Llena “donates or renders gratuitously a portion of its services or facilities.” The district court concluded that “Section 7-36-7(B)(l)(d) does notprovide for a minimum amount of charitable acts” and that the word “portion” in Section 7-36-7(B)(l)(d) does not contain a quantitative meaning. According to the district court, La Vida Llena donated or rendered a portion of its facilities and services because the Board found that “unchallenged evidence [establishes that La Vida Llena] donated the use of meeting rooms, that it donated some services of its employees, and that it donated approximately $65,000 in 2009 and $100,000 in 2010 through [the foundation.” The district court also stated that La Vida Llena “provided evidence that it provides care at a cost greater than what it is reimbursed through Medicaid, and considers the cost-differential it absorbs to be a donation” and that it does not terminate agreements with residents for failure to pay when the resident cannot afford the monthly fees.\n{7} The Assessor petitioned this Court for a writ of certiorari pursuant to Rule 12-505(C) NMRA, which this Court granted. The Assessor argues that the district court erred in reversing the decision of the Board by (1) incorrectly determining that the word “portion” in Section 7-36-7(B)(l)(d) does not contain a minimum quantitative threshold on the amount of services and facilities that a continuing care facility must donate or render gratuitously; and (2) rejecting the Board’s factual finding that La Vida Llena failed to donate a “meaningful” portion of its services or facilities to qualify for the exemption contained in Section 7-36-7(B)(l)(d).\n{8} The only issue on appeal is whether La Vida Llena “donates or renders gratuitously a portion of its services or facilities” as contemplated by Section 7-36-7(B)(l)(d). The Assessor concedes that La Vida Llena operates as a continuing care facility under the Continuing Care Act, has been granted an exemption from federal income taxes pursuant to § 501(c)(3), and “uses all funds remaining after payment of its usual and necessary expenses of operation, including the payment of liens and encumbrances upon its property, to further its charitable purpose, including the maintenance, improvement or expansion of its facilitiesf.]” Section 7-36-7(B)(l)(d).\nSECTION 7-36-7(B)(l)(d)\nStandard of Review\n{9} Upon a grant of a petition for writ of certiorari under Rule 12-505, this Court “conduces] the same review of an administrative order as the district court sitting in its appellate capacity, while at the same time determining whether the district court erred in the first appeal.” Rio Grande Chapter of Sierra Club v. N.M. Mining Comm’n, 2003-NMSC-005, ¶ 16, 133 N.M. 97, 61 P.3d 806. In conducting our whole record review, we review the “record of the administrative hearing to determine whether the [bjoard’s decision was arbitrary and capricious, not supported by substantial evidence, or otherwise not in accordance with law.” Smyers v. City of Albuquerque, 2006-NMCA-095, ¶ 5, 140 N.M. 198, 141 P.3d 542 (internal quotation marks and citation omitted). When an administrative decision is based on an issue of law, such as statutory interpretation, our review is de novo. ERICA, Inc. v. N.M. Regulation & Licensing Dep’t, 2008-NMCA-065, ¶ 11, 144 N.M. 132, 184 P.3d 444. However, although we engage in whole record review, we will not disturb any of an agency’s factual findings that are supported by substantial evidence. Montano v. N.M. Real Estate Appraiser’s Bd., 2009-NMCA-009, ¶ 8, 145 N.M. 494, 200 P.3d 544.\nQuantitative Meaning of “Portion”\n{10} We first address the Assessor’s argument that the district court erred in determining that Section 7-36-7(B)(1)(d) does not provide for a minimum threshold amount of facilities or services that a continuing care facility must donate or render gratuitously because the word “portion” does not contain a quantitative meaning. In the Assessor’s view, a reasonable interpretation of the word “portion” requires that a continuing care facility gratuitously donate some meaningful quantitative amount or percentage of its revenue in order to meet the statutory requirement for an exemption. Without such a quantitative requirement, the Assessor asserts that the gratuitous donation requirement in the statute becomes superfluous. This issue requires the Court to interpret the statutory language in Section 7-36-7(B)(l)(d).\n{11} In engaging in statutory construction, our primary purpose is to give effect to the intent of the Legislature. Bd. of Educ. v. N.M. State Dep’t of Pub. Educ., 1999-NMCA-156, ¶ 16, 128 N.M. 398, 993 P.2d 112. “The first rule is that the plain language of a statute is the primary indicator of legislative intent. Courts are to give the words used in the statute their ordinary meaning unless the [Legislature indicates a different intent. The court will not read into a statute . . . language which is not there, particularly if it makes sense as written.” Johnson v. N.M. Oil Conservation Comm’n, 1999-NMSC-021, ¶ 27, 127 N.M. 120, 978 P.2d 327 (internal quotation marks and citations omitted). Although we apply the plain meaning rule, a “construction must be given which will not render the statute’s application absurd or unreasonable and which will not defeat the object of the Legislature.” Cox v. N.M. Dep’t of Pub. Safety, 2010-NMCA-096, ¶ 15, 148 N.M. 934, 242 P.3d 501 (internal quotation marks and citation omitted). Additionally, when interpreting a statute, all sections of the statute “must be read together so that all parts are given effect.” High Ridge Hinkle Joint Venture v. City of Albuquerque, 1998-NMSC-050, ¶ 5, 126 N.M. 413, 970 P.2d 599.\n{12} The Assessor also contends that the gratuitous donation requirement of Section 7-36-7(B)(l)(d) must contain a quantitative element in order to prevent a continuing care facility from abusing the available tax exemption. However, the Assessor’s view is unduly focused on the word “portion,” and the singular requirement that a continuing care facility donate or render gratuitously a portion of its services or facilities. The donation of services or facilities is only one of the requirements of Section 7-36-7(B)(l)(d). When we read the three requirements together, the legislative intent becomes apparent. See Key v. Chrysler Motors Corp., 121 N.M. 764, 769, 918 P.2d 350, 355 (1996) (“[A]ll parts of a statute must be read together to ascertain legislative intent. We are to read the statute in its entirety and construe each part in connection with every other part to produce a harmonious whole.” (citation omitted)). First, the Legislature required that the facility be exempt from federal income taxes. Section 7-36-7(B)(l)(d). Additionally, Section 7-36-7(B)(1)(d) requires that a continuing care facility “use[] all funds remaining after payment of its usual and necessary expenses of operation ... to further its charitable purpose[.]” Through this last requirement, Section 7-36-7(B)(l)(d) contains a mandate that a continuing care facility use all of its proceeds to further its charitable purpose. By not defining a minimum gratuitous contribution amount in the second requirement, the Legislature has provided flexibility for a continuing care facility to qualify for its property tax exemption while also allowing the facility to annually determine the most appropriate way of achieving its overall charitable purposes.\n{13} The plain meaning of the word “portion” further reinforces our conclusion. When determining the plain meaning of a term in a statute, we are guided by the common and ordinary use of the term as ascertained by a dictionary. See Battishill v. Farmers Alliance Ins. Co., 2006-NMSC-004, ¶ 8, 139 N.M. 24, 127 P.3d 1111 (“We . . . hold that the common and ordinary meaning . . . may be ascertained from a dictionary.”). In this context, “portion” is defined as “an individual’s part or share of something” or “a part of a whole.” Webster’s Third New Int’l Dictionary 1768 (Unabridged 1993). The plain meaning of “portion” is therefore synonymous with “part” and does not contain a minimum quantitative meaning. Accordingly, under the plain meaning rule, Section 7-36-7(B)(l)(d) does not require a minimum amount of donated or gratuitously rendered services or facilities for charitable purposes in order for the continuing care facility to receive the property tax exemption.\n{14} If the Legislature had intended for “portion” in Section 7-36-7(B)(l)(d) to contain a minimum threshold amount for the required charitable contributions, it would have expressly provided the manner for determining the intended amount. See Bishop v. Evangelical Good Samaritan Soc’y, 2009-NMSC-036, ¶ 16, 146 N.M. 473, 212 P.3d 361 (stating that “[i]f the Legislature had intended to create different standards . . ., it likely would have done so expressly”). The Legislature has expressly defined “portion” in other statutes, including tax statutes, when it intended that the word “portion” to contain a minimum or threshold amount. See, e.g., NMSA 1978, § 7-1-36(B) (1993) (stating that “there shall also be exempt from levy on an employer of the taxpayer the greater of the following portions of the taxpayer’s disposable earnings: (1) seventy-five percent of the taxpayer’s disposable earnings for any pay period; or (2) an amount each week equal to forty times the federal minimum hourly wage rate” (emphasis added)); NMSA 1978, § 6-6-19(B) (2011) (“The amount that may be deposited into the local government permanent fund is any portion of the unappropriated general fund surplus that is in excess of fifty percent of the prior fiscal year’s budget of the county or municipality.” (emphasis added)).\n{15} The Assessor also argues that the plain meaning of “portion” is not so easily ascertainable and that “[a]n examination of different dictionary definitions of portion reveals that it is a dynamic word with a variety of possible meanings.” The Assessor further argues that due to the various meanings of “portion,” we should construe Section 7-36-7(B)(1)(d) as requiring that the portion a continuing care facility donates or renders gratuitously for charitable purposes should exceed the benefit that the public loses in tax revenue as a result of the exemption. In the Assessor’s view, this interpretation of the “donation requirement should be decided on a case[-]by[-]case basis” and furthers the legislative purpose of “encourag[ing] charitable activities by providing them with tax relief, and to thereby promote the general welfare of society.” Sisters of Charity v. Cnty. of Bernalillo, 93 N.M. 42, 45, 596 P.2d 255, 258 (1979). However, as the Assessor conceded at oral argument, a formula for such an inquiry is not readily ascertainable from Section 7-36-7(B)(1)(d), nor did the Assessor provide this Court with a framework to evaluate when a donation or rendering of services or facilities is sufficiently large enough to be a “portion.”\n{16} Additionally, the Assessor’s interpretation of Section 7-36-7(B)(l)(d) requires that this Court essentially rewrite the statute and place a minimum donation amount comparable to the loss of tax revenue. We decline to do so. See Martinez v. Sedillo, 2005-NMCA-029, ¶ 7, 137 N.M. 103, 107 P.3d 543 (“We will not rewrite a statute.”). Although, we agree that “portion” is a dynamic word and can have a number of possible meanings depending on the context, the Assessor fails to point to a single definition of “portion” that contains a quantitative minimum or any definition that supports its interpretation.\n{17} Section 7-36-7(B)(l)(d) provides the mechanism for a continuing care facility with a federal income tax exemption to be exempt from property tax. It contains the legislative intent to encourage a continuing care facility to engage in charitable activity by requiring only that the continuing care facility donate or render gratuitously a part of its services or facilities without a threshold requirement, provided that, after payment of operational expenses, it uses the balance of its funds for charitable purposes. The district court did not err in concluding that “Section 7-36-7(B)(1)(d) does not provide for a minimum amount of charitable acts.”\nDeference to Factual Findings\n{18} The Assessor also argues that the district court erred when, without citing any authority or acknowledging the standard of review, it rejected the Board’s factual determination that La Vida Llena failed to prove that it donated a meaningful portion of its goods or services.\n{19} Essentially, the Assessor argues that the district court failed to defer to several findings of fact considered by the Board that: (1) the donated meeting space was for organization and activities that are an integral part of the experience La Vida Llena offers to residents; (2) no material portion of La Vida Llena’s services or facilities are donated or gratuitously rendered, and their use is incidental to its business operations; (3) the foundation was merely a vehicle of mutual assistance between residents of La Vida Llena and did not constitute charitable donations by La Vida Llena itself; and (4) there is no charity when the cost of service to long-term residents is less than actual revenues from those residents. We agree with the Assessor that a district court sitting in an appellate capacity and reviewing an agency’s decision must accept all factual findings made by the agency as a factfinder that were supported by substantial evidence. See Montano, 2009-NMCA-009, ¶ 8 (“We will not disturb the agency’s factual findings if supported by substantial evidence, although we engage in a whole record review.”); see also Martinez v. N.M. State Eng’r Office, 2000-NMCA-074, ¶ 48, 129 N.M. 413, 9 P.3d 657 (stating that “in administrative appeals the district court is a reviewing court, not a fact-finder”). Thus, to the extent that substantial evidence supports the Board’s factual findings, the district court was required to give the factual findings deference and not substitute its judgment for that of the Board.\n{20} However, the Assessor does not challenge the Board’s findings that La Vida Llena (1) provides service to Medicaid residents when space is available and that the actual cost of care to these Medicaid residents exceeds the Medicaid reimbursement and that this amount was approximately $30,000 in 2009; (2) permits its staff time to serve other charitable organizations; (3) provides services such as bookkeeping and safeguarding for the foundation even though it does not actually provide funds for the foundation; and (4) does not terminate resident agreements if residents do not pay, although it is permitted to do so in the resident agreements. Indeed, at oral argument, the Assessor conceded that there is a charitable aspect to providing service to Medicaid residents that exceeds Medicaid reimbursement. These factual findings are therefore binding on appeal. See Franco v. Carlsbad Mun. Sch., 2001-NMCA-042, ¶ 13, 130 N.M. 543, 28 P.3d 531 (stating that unchallenged factual findings are binding on appeal). These uncontested factual findings made by the Board support a determination that La Vida Llena donated or rendered gratuitously at least some “portion” of its facilities and services.\n{21} To the extent that the Assessor contends that the factual findings indicate that the Board did not find that La Vida Llena rendered a “meaningful” amount of its goods and services to qualify for the exemption, this argument simply restates the previous argument that “portion” as used in Section 7-3 6-7(B)(1)(d) has a quantitative threshold. The meaning of “portion” and whether it contains a quantitative threshold is a legal question requiring statutory interpretation, not a factual determination entitled to deference. We have concluded that “portion” contemplates no such threshold requirement.\nCONCLUSION\n{22} The district court did not err by determining that Section 7-36-7(B)(l)(d) does not require a minimum amount of donated or gratuitously rendered services or facilities for charitable purposes in order for the continuing care facility to receive the property tax exemption. Additionally, the district court did not err by failing to give deference to certain findings of the Board. Accordingly, we affirm.\n{23} IT IS SO ORDERED.\nJAMES J. WECHSLER, Judge\nWE CONCUR:\nMICHAEL E. VIGIL, Judge\nTIMOTHY L. GARCIA, Judge", "type": "majority", "author": "WECHSLER, Judge."}], "attorneys": ["Modrall, Sperling, Roehl, Harris & Sisk, P.A. Zachary L. McCormick Albuquerque, NM for Appellee", "Randy M. Autio, Bernalillo County Attorney Eric W. Schuler, Assistant County Attorney Albuquerque, NM for Appellant"], "corrections": "", "head_matter": "IN THE COURT OF APPEALS OF THE STATE OF NEW MEXICO\nOpinion Number: 2013-NMCA-048\nFiling Date: February 19, 2013\nDocket No. 31,711\nLA VIDA LLENA, Protestant-Appellee, v. KAREN L. MONTOYA, BERNALILLO COUNTY ASSESSOR, BERNALILLO COUNTY VALUATION PROTEST BOARD, Respondent-Appellant.\nModrall, Sperling, Roehl, Harris & Sisk, P.A. Zachary L. McCormick Albuquerque, NM for Appellee\nRandy M. Autio, Bernalillo County Attorney Eric W. Schuler, Assistant County Attorney Albuquerque, NM for Appellant"}}}
{"id": 4190761, "url": "https://api.case.law/v1/cases/4190761/", "name": "STATE OF NEW MEXICO, Plaintiff-Appellee, v. DAVID CASTILLO, Defendant-Appellant", "name_abbreviation": "State v. Castillo", "decision_date": "2012-08-14", "docket_number": "No. 33,803; Docket No. 31,269", "first_page": "67", "last_page": "74", "citations": [{"type": "official", "cite": "2012-NMCA-116"}], "volume": {"url": "https://api.case.law/v1/volumes/32044132274747/", "volume_number": "3", "barcode": "32044132274747"}, "reporter": {"url": "https://api.case.law/v1/reporters/1028/", "full_name": "New Mexico Appellate Reports", "id": 1028}, "court": {"url": "https://api.case.law/v1/courts/nm-ct-app/", "name_abbreviation": "N.M. Ct. App.", "slug": "nm-ct-app", "id": 9025, "name": "Court of Appeals of New Mexico"}, "jurisdiction": {"id": 52, "name_long": "New Mexico", "url": "https://api.case.law/v1/jurisdictions/nm/", "slug": "nm", "whitelisted": true, "name": "N.M."}, "cites_to": [], "frontend_url": "https://cite.case.law/nmca/2012/116/4190761/", "frontend_pdf_url": "https://cite.case.law/pdf/4190761/State%20v.%20Castillo,%202012-NMCA-116%20(2012).pdf", "preview": [], "analysis": {"cardinality": 873, "char_count": 20247, "ocr_confidence": 0.81, "pagerank": {"raw": 4.076306636737454e-08, "percentile": 0.13942301116658037}, "sha256": "e1a8105b81498526b9036615102038276ac34d9474fbbc0d0241cfaf6d1aef37", "simhash": "1:dd47a7693bcb40ed", "word_count": 3092, "random_id": 2830114912, "random_bucket": 8288}, "last_updated": "2021-08-10T17:15:42.557742+00:00", "provenance": {"date_added": "2019-08-29", "source": "CAP", "batch": "2018"}, "casebody": {"status": "ok", "data": {"judges": ["J. MILES HANISEE, Judge", "MICHAEL D. BUSTAMANTE, Judge", "LINDA M. VANZI, Judge"], "parties": ["STATE OF NEW MEXICO, Plaintiff-Appellee, v. DAVID CASTILLO, Defendant-Appellant."], "opinions": [{"text": "OPINION\nHANISEE, Judge.\n{1} Defendant David Castillo was sentenced following an agreement with the State in which he pleaded no contest to criminal sexual penetration in the second degree. Defendant’s ensuing nine-year incarcerative sentence was suspended, and he was placed on supervised probation for a total of five years, commencing on December 16, 2005. As a special condition of his probation, Defendant was required to “enter and successfully complete a sex offender specific therapy to include polygraph testing as deemed necessary by the therapist.” In April 2010, the State filed a motion to revoke Defendant’s probation for failure to successfully complete a sex offender treatment program. A probation revocation hearing was held, and Defendant’s probation was revoked on December 14, 2010, a single day prior to its scheduled completion.\n{2} On appeal, Defendant argues that his right to confrontation was violated when the district court allowed the head of Forensic Therapy Service, the sex offender treatment center at which Defendantwas apatient, to testify about the results of his polygraph examination — rather than requiring that the State call the individual who actually administered the polygraph test. B ased on our New Mexico Supreme Court’s opinion in State v. Guthrie, 2011-NMSC-014, 150 N.M. 84, 257 P.3d 904, Defendant’s claim of error requires this Court to consider “the need for, and utility of, confrontation with respect to the truth-finding process and in light of the particular case at hand, including the specific charge pressed against the probationer.” Id. ¶ 43. Having taken this standard into consideration, we conclude that Defendant’s Fourteenth Amendment right to due process was violated by the district court’s allowance of testimony regarding Defendant’s polygraph results by someone other than the person who actually administered and interpreted the polygraph test. Accordingly, we reverse.\nBACKGROUND\n{3} Prior to the probation revocation hearing, Defendant filed a motion in limine or, in the alternative, a motion for continuance. In it, Defendant primarily sought to exclude any testimony regarding the results of his polygraph test from a witness other than Ralph Trotter, who administered Defendant’s polygraph test. Defendant argued that he possessed a due process right to confront the witnesses against him even in the context of a probation revocation proceeding, and absent a showing that there was good cause for not producing Mr. Trotter, the State should be barred from proceeding on the petition to revoke if it planned to present evidence regarding the polygraph. Defendant specifically asserted that absent Mr. Trotter’s testimony and availability for cross-examination, Defendant would be unable to test Mr. Trotter’s credentials and the manner in which the purportedly failed polygraph test was effectuated, and thus the district court lacked a constitutionally adequate basis to conclude that the asserted polygraph results were reliable. Alternatively, Defendant requested an extension of time to permit his chosen expert polygraph examiner the opportunity to review the materials related to the polygraph test and provide testimony regarding his own independent conclusions.\n{4} At the hearing, D efendant maintained that the polygraph results were central to proving the existence of any probation violation. The State countered that the probation violation was notbased exclusively on an allegation that Defendant failed his polygraph, but on the broader allegation that Defendant had “failed to fully cooperate and complete the sex offender treatment.” The State added that Therese Duran, the supervisor of Forensic Therapy Service, could competently testify regarding “the problems with the polygraphs, [that] they changed the course of treatment and still failed, because [D]efendantrefused to engage.” Defendant insisted that the core of Ms. Duran’s testimony would be as follows: “If the person is not admitting that they did the offense conduct, and the polygraph tests indicate that they are lying about that, then they consider the person to be noncompliant with the therapy.” Thus, while Defendant argued that the polygraph evidence was central to the proof of the probation violation, the State argued that evidence of the polygraph was not actually necessary to prove the violation. The district court took the motion in limine under advisement pending Ms. Duran’s testimony.\n{5} Ms. Duran testified that she supervised Defendant’s sex offender treatment and made the ultimate decision to terminate him from the program in late March 2010, roughly six months prior to Defendant’s completion of his five-year term of probation. She discussed the two distinct ways polygraphs were used by Forensic Therapy Service as part of the sex offender treatment program. Maintenance polygraphs were used to ensure compliance with the terms of probation — such as the prohibition against being within the specified vicinity of children. Ms. Duran testified that Defendant had passed all of his maintenance polygraph exams. Polygraph exams were additionally conducted regarding the sexual offenses with which the client was charged in order to determine the best course of treatment. According to Ms. Duran’s testimony, Forensic Therapy Service soughtto address all charges initially brought against the client (not only those to which the client pleaded or was convicted of), and if there were discrepancies between those charges and the client’s explanation of events, Forensic Therapy Service relied on polygraphs to resolve the incongruence.\n{6} According to Ms. Duran, based on Defendant’s polygraph results, he was considered to be in “denial” and was placed on a different treatment path aimed at achieving accountability for all conduct with which he was originally charged. Ms. Duran did not provide any testimony as to the manners in which Defendant’s polygraph test was conducted or its results were interpreted to reach the conclusion that he was being deceptive. Instead, Ms. Duran summarily stated that Defendant was placed in the “failed polygraph group” due to an indication of deception. She further maintained that he “significantly failed all of the polygraphs related to his sexual offense,” but that she did not “recall what the numbers were,” only that they were “clearly deceptive.”\n{7} Ms. Duran also discussed how Forensic Therapy Service utilized different therapists and therapies in an effort to progress beyond Defendant’s “deception” to achieve a therapeutically “accountable phase.” According to Ms. Duran, the difficulty with Defendant’s progress was his lack of “[a]ny form of accountability!].]” Once his initial polygraph tests showed deception, Ms. Duran testified that there was no way for Defendant to have graduated from the program without admitting the underlying offense. Ultimately, according to Ms. Duran, Defendant was released from the program for noncompliance “[b]ecause he was not being accountable.”\n{8} Following Ms. Duran’s testimony, Defendant reasserted his consistently argued position:\nIn order for them to admit the testimony regarding the polygraph test results, pass or fail, they need more than Ms. Duran coming up and saying she got a report from someone. I don’t think the fact that she got a report is a reliable indication of whether or not the polygraph test was performed by somebody with the ability to perform it, that it was performed with the proper procedures, that the results obtained were reliable, what the level of deception — if that’s even an important indication for the polygraph tests — were. What we’re talking about is a scientific test. And the only person who testified has just seen the yes-or-no answer. . . .\nI think Ms. Duran’s pretty clear. The reason [Defendant] was terminated from the program was because he did not admit to the offense conduct. And the reason [why] that is a problem is because they believe he failed polygraph tests, indicating that he was lying about that. If he had passed these polygraph tests, by Ms. Duran’s own admission, he would be out of this program. He would be in a different one, maybe. But he would have successfully completed their program.\nThe State reiterated that it was not the polygraph but Defendant’s continued denial that justified revocation. The district court found that the polygraphs were “a component of [Defendant’s] failure to finish the program” but that there were also “other behaviors and actions that were interpreted by the staff [as Djefendant . . . not engaging.” The district court therefore denied Defendant’s motion in limine. Following supplemental testimony by Defendant’s probation officer, which did not bear further on the issue of the polygraph, the district court revoked Defendant’s probation. The court further elected not to continue the proceeding in order to accommodate the alternative relief requested by Defendant — an opportunity to present his own expert.\nDISCUSSION\n{9} “Revocation of probation deprives an individual, not of the absolute liberty to which every citizen is entitled, but only of the conditional liberty properly dependent on observance of special [probation] restrictions.” Guthrie, 2011-NMSC-014, ¶10 (alteration in original) (quoting Gagnon v. Scarpelli, 411 U.S. 778,781 (1973)) (internal quotation marks omitted). “Because loss of probation is loss of only conditional liberty, ‘the full panoply of rights due a defendant in a [criminal trial] do [ ] not apply.’” Id. (alteration in original) (quoting Morrisey v. Brewer, 408 U.S. 471, 480 (1972)). Hence, “[t]he right protected in probation revocation[ cases] is not the [S]ixth [A]mendment right to confrontation, guaranteed every accused in a criminal trial, but rather the more generally worded right to due process of law secured by the [Fourteenth [A]mendment.” Guthrie, 2011-NMSC-014, ¶ 12. Due process includes “the right to confront and cross-examine adverse witnesses (unless the hearing officer specifically finds good cause for not allowing confrontation).” State v. Vigil, 91 N.M. 749, 751, 643 P.2d 618, 620 (Ct. App. 1982) (internal quotation marks omitted). Whether Defendant’s due process right to confrontation was violated is a question of law. We review questions of law de novo while deferring to the district court’s factual findings. Guthrie, 2011-NMSC-014, ¶ 22.\n{10} Our Supreme Court has directed the courts — when discharging their duty to find good cause for lack of confrontation — to consider “whether confrontation of the witness is essential to the truth-finding process in the context of probation revocation.” Id. ¶ 2. This entails considering whether the challenged hearsay evidence “relatefs] to objective or subjective observations, assert[s] that a probationer acted or failed to act as required, or supports] facts that are central or ancillary to the ultimate probation violation inquiry.” Id. ¶¶ 34, 37. Stated more specifically, our courts are to consider whether: (1) “the assertion [is] central to the reasons for revocation}] or . . . collateral,” (2) “the assertion [is] contested by the probationer, or... the state [is] being asked to produce a witness to establish something that is essentially uncontroverted,” and (3) the assertion is “inherently reliable.” Id. ¶¶ 34, 36.\n{11} Our Supreme Court presented the consideration of these factors as falling on a sliding scale “with extremes at either end and much balancing and weighing of competing interests in between.” Id. ¶ 40. On one end of the spectrum, Guthrie provides that good cause for not requiring confrontation will most likely exist where\nthe state’s evidence is uncontested, corroborated by other reliable evidence, and documented by a reliable source without a motive to fabricate, or possibly situations where the evidence is about an objective conclusion, a routine recording, or a negative fact, making the demeanor and credibility of the witness less relevant to the truth-finding process.\nId. On the other end of the spectrum, Guthrie provides that good cause will most likely not exist where\nevidence is contested by the defendant, unsupported or contradicted, and its source has a motive to fabricate; it is about a subjective, judgment-based observation that is subject to inference and interpretation, and makes a conclusion that is central to the necessary proof that the defendant violated probation.\nId. ¶ 41.\n{12} We begin our consideration of the utility of confrontation under the particular facts of this case by looking at the nature of the evidence presented. Defendant argues that in contrast to the evidence challenged in Guthrie, the polygraph evidence here was central and contested, as opposed to being merely objective, routine or independently proven. In Guthrie, the defendant was placed on supervised probation and agreed to attend a ninety-day residential treatment program as part of a plea agreement. Id. ¶ 3. The State filed a motion to revoke probation based on the defendant’s failure to complete the program. Id. ¶4. At the probation revocation hearing, the defendant’s probation officer did not testify; rather, the probation officer’s supervisor testified and referred to documents contained in the defendant’s probation file. Id. ¶¶ 4-6. Based on the supervisor’s testimony, the district court revoked the defendant’s probation. In affirming the revocation, our Supreme Court relied on the fact that the defendant did not contest the allegation that he failed to complete the treatment program and that the defendant’s non-compliance was “an objective, negative, and rather routine fact” that “was easily and reliably established to a reasonable degree of certainty by a written statement from the treatment center.” Id. ¶ 46. In addition, our Supreme Court noted that there was little that could be gained by testimony from a direct employee of the treatment center under the facts of that case, and that the district court had independently corroborated the State’s testimony by taking judicial notice that it would have been factually impossible for the defendant to have completed the treatment as required, given the time and place of the defendant’s arrest. Id. ¶¶ 47-48.\n{13} “[T]he procedural protections inherent in the truth-finding process, such as a hearing or confrontation, are only necessary when the truth of the state’s allegation is challenged.” Id. ¶ 35. Thus, in Guthrie, our Supreme Court considered to be important the fact that the “[defendant never created any doubt in the truth of the evidence offered by the State.” Id. ¶34. It further noted that many courts would question the need for “a live witness to establish an evidentiary fact (failure to complete) that is never challenged for its accuracy or its reliability.” Id. In contrast, Defendant here emphatically challenged the reliability of the polygraph evidence in his motion in limine, his arguments on the issue, and his secondary effort to attain a continuance in order to present expert evidence rebutting the State’s polygraph testimony.\n{14} In addition, Defendant demonstrated through cross-examination of the State’s witnesses that the polygraph evidence was central to the State’s allegation that Defendant had failed to complete his treatment program. Ms. Duran testified that Defendant’s termination from the program was based upon his lack of accountability for the conduct with which he was originally charged. According to Ms. Duran, Defendant was only required to admit to the conduct with which he was first charged because his polygraph indicated that his denial of it was deceptive. If, on the other hand, Defendant’s polygraph had not indicated deception, no such admission would have been required. Because the testimony at the probation revocation hearing clearly indicates that Defendant’s ultimate failure to admit the offense conduct led to his termination from the program, the polygraph evidence that established the unresolved conflict was “central to the reasons for revocation.” Id.\n{15} Furthermore, Defendant accurately points out that polygraph evidence is neither objective nor routine. Instead, polygraph examiners are required to be licensed and adhere to specific procedures in the administration and interpretation of polygraph exams. Ms. Duran’s foundation-less testimony that Defendant’s polygraph examination indicated deception therefore gives this Court pause. “Evidence supporting subjective conclusions, which may require confrontation, includes sensory-based or judgment-based determinations or interpretations}.]” Id. ¶ 38. The conclusion testified to by Ms. Duran in explaining why Defendant was terminated from the sex offender treatment program was the direct product of Mr. Trotter’s interpretation of the polygraph results and his judgment-based determination that the results indicated deception. The State characterizes the evidence at issue as “the straightforward fact of treatment completion.” However, the incompletion of treatment in this instance is not premised on an objective fact as was the case in Guthrie-, rather, the genesis of Defendant’s failure to complete treatment was based on the State’s evidentiary assertions and argument regarding the' results of his polygraph exam. See id. ¶¶ 8, 48 (noting that the defendant’s failure to complete treatment was based on him not being present at the treatment facility). According to the Guthrie analysis, such subjective conclusions weigh compellingly in favor of requiring an opportunity for cross-examination. Id. ¶ 37 (citing Bailey v. State, 612 A.2d 288, 294 (Md. 1992) (“A second consideration may be whether the proffered hearsay is an objective fact reported by the declarant or instead contains conclusions which ought to be tested by cross-examination.”)).\n{16} The State does not directly address Defendant’s argument that the evidence was central, contested, and not objective or routine. Instead, the State contends that evidence regarding the polygraph was not necessary to proving Defendant’s violation of the conditions of his probation and that the burden to subpoena Mr. Trotter was on Defendant because the polygraph results were evidence of mitigation — in other words, a reason Defendant was unable to complete the treatment rather than proof of a violation of his probation. Despite the State’s contention that introduction of evidence regarding the polygraph results was unnecessary to prove a violation of Defendant’s conditions of probation, that is not the case before us. Rather, the State chose to introduce the polygraph results through Ms. Duran, along with Defendant’s refusal to admit all initially charged conduct, as well as the corresponding changes in Defendant’s treatment and his ultimate termination from the program. In the context of a probation revocation proceeding, we look to Guthrie to see if the evidence the State has elected to present situationally triggers a right of confrontation. Based on the centrality of the polygraph evidence in this circumstance, the subjective and interpretative nature of it, and the fact that Defendant challenged its reliability, we conclude that this case falls on the “no good cause” end of the spectrum established in Guthrie. Id. ¶ 41. Contrary to the circumstances in Guthrie, the utility of confrontation under these facts is evident.\nCONCLUSION\n{17} For the reasons stated above, we hold that Defendant’s Fourteenth Amendment right to due process was violated by the district court’s decision to allow Ms. Duran to testify exclusively regarding Defendant’s polygraph results. Accordingly, we reverse and remand for further proceedings.\n{18} IT IS SO ORDERED.\nJ. MILES HANISEE, Judge\nWE CONCUR:\nMICHAEL D. BUSTAMANTE, Judge\nLINDA M. VANZI, Judge", "type": "majority", "author": "HANISEE, Judge."}], "attorneys": ["Gary K. King, Attorney General Olga Serafimova, Assistant Attorney General Santa Fe, NM for Appellee", "Streubel Kochersberger Mortimer, LLC Donald F. Kochersberger III Albuquerque, NM for Appellant"], "corrections": "", "head_matter": "Certiorari Denied, October 10, 2012,\nNo. 33,803\nIN THE COURT OF APPEALS OF THE STATE OF NEW MEXICO\nOpinion Number: 2012-NMCA-116\nFiling Date: August 14, 2012\nDocket No. 31,269\nSTATE OF NEW MEXICO, Plaintiff-Appellee, v. DAVID CASTILLO, Defendant-Appellant.\nGary K. King, Attorney General Olga Serafimova, Assistant Attorney General Santa Fe, NM for Appellee\nStreubel Kochersberger Mortimer, LLC Donald F. Kochersberger III Albuquerque, NM for Appellant"}}}
